doc/Kong DV2 - Round 2 Load Testing.txt
Timeframe
5/10/2024 8:15 - 9:45 AM Eastern Time
Load Testing Scenarios
We executed two Load Testing runs of 30 minutes each.
The first run we achieved a maximum Request per Minute (RPM) of 109K.  The endpoints exercised were:
devtest{X}.invoicecloud.com/crm/
devtest{X}.invoicecloud.com/crm/healthcheck.aspx
kong.dev.invoicecloud.com/api
kong.dev.invoicecloud.com/
api.{env}.invoicecloud.com/payer/v1/one-time-payment-api/health
api.{env}.invoicecloud.com/payer/v1/payer-portal-ui/health
api.{env}.invoicecloud.com/payer/v1/pay-by-text-api/health
The second run we achieved a maximum Request per Minute (RPM) of 205k.  The endpoints exercised were:
devtest{X}.invoicecloud.com/crm/
kong.dev.invoicecloud.com/api
kong.dev.invoicecloud.com/
api.{env}.invoicecloud.com/payer/v1/one-time-payment-api/health
api.{env}.invoicecloud.com/payer/v1/payer-portal-ui/health
api.{env}.invoicecloud.com/payer/v1/pay-by-text-api/health
Node Configuration
  Namespace                   Name                                                           CPU Requests  CPU Limits  Memory Requests  Memory Limits  Age
  ---------                   ----                                                           ------------  ----------  ---------------  -------------  ---
  kong                        api-gateway-kong-5f4bb66f65-j8cp7                              900m (47%)    0 (0%)      800Mi (14%)      0 (0%)         3d
  kube-system                 azure-ip-masq-agent-zq246                                      100m (5%)     500m (26%)  50Mi (0%)        250Mi (4%)     3d
  kube-system                 cloud-node-manager-qkrgq                                       50m (2%)      0 (0%)      50Mi (0%)        512Mi (9%)     3d
  kube-system                 csi-azuredisk-node-7nqjh                                       30m (1%)      0 (0%)      60Mi (1%)        400Mi (7%)     3d
  kube-system                 csi-azurefile-node-zf44g                                       30m (1%)      0 (0%)      60Mi (1%)        600Mi (11%)    3d
  kube-system                 kube-proxy-b4pg2                                               100m (5%)     0 (0%)      0 (0%)           0 (0%)         3d
  newrelic                    newrelic-bundle-newrelic-logging-6hs9l                         150m (7%)     300m (15%)  64Mi (1%)        128Mi (2%)     3d
  newrelic                    newrelic-bundle-nrk8s-kubelet-v2lp9                            200m (10%)    0 (0%)      300M (5%)        600M (10%)     3d
  opentelemetry               opentelemetry-daemonset-opentelemetry-collector-agent-v5hzf    100m (5%)     100m (5%)   200M (3%)        200M (3%)      3d
Allocated resources:
  (Total limits may be over 100 percent, i.e., overcommitted.)
  Resource           Requests          Limits
  --------           --------          ------
  cpu                1660m (87%)       900m (47%)
  memory             1636656384 (29%)  2716610Ki (49%)
  ephemeral-storage  0 (0%)            0 (0%)
  hugepages-1Gi      0 (0%)            0 (0%)
  hugepages-2Mi      0 (0%)            0 (0%)
HPA Configuration
autoscaling:
  enabled: true
  minReplicas: 3
  maxReplicas: 6
  metrics:
    - type: Resource
      resource:
        name: cpu
        target:
          type: Utilization
          averageUtilization: 70
Results from Load Testing
Kong and Payer NextGen APIs Results from Michael AVD
    execution: local
        script: tests-kong-and-payer-nextgen-from-nonprod-avd.js
        output: -

     scenarios: (100.00%) 1 scenario, 1200 max VUs, 26m30s max duration (incl. graceful stop):
              * average_load: Up to 1200 looping VUs for 26m0s over 7 stages (gracefulRampDown: 30s, gracefulStop: 30s)


     █ Kong API

       ✓ status was 401
       ✗ transaction time 1 second
        ↳  99% — ✓ 48637 / ✗ 6
       ✓ body size OK
       ✓ body contains string

     █ Kong UI

       ✓ status was 200
       ✗ transaction time 1 second
        ↳  99% — ✓ 48640 / ✗ 3
       ✓ body size OK
       ✓ body contains string

     █ SBX One Time Payment API Health Check

       ✓ status was 200
       ✓ transaction time 1 second
       ✓ body size OK
       ✓ body contains string

     █ DEV One Time Payment API Health Check

       ✓ status was 200
       ✗ transaction time 1 second
        ↳  99% — ✓ 48642 / ✗ 1
       ✓ body size OK
       ✓ body contains string

     █ IAT One Time Payment API Health Check

       ✓ status was 200
       ✓ transaction time 1 second
       ✓ body size OK
       ✓ body contains string

     █ QAR One Time Payment API Health Check

       ✓ status was 200
       ✓ transaction time 1 second
       ✓ body size OK
       ✓ body contains string

     █ XAT One Time Payment API Health Check

       ✓ status was 200
       ✓ transaction time 1 second
       ✓ body size OK
       ✓ body contains string

     █ DEV Payer Portal UI Health Check

       ✓ status was 200
       ✗ transaction time 1 second
        ↳  99% — ✓ 48641 / ✗ 2
       ✓ body size OK
       ✓ body contains string

     █ IAT Payer Portal UI Health Check

       ✓ status was 200
       ✓ transaction time 1 second
       ✓ body size OK
       ✓ body contains string

     █ QAR Payer Portal UI Health Check

       ✓ status was 200
       ✗ transaction time 1 second
        ↳  99% — ✓ 48641 / ✗ 2
       ✓ body size OK
       ✓ body contains string

     █ XAT Payer Portal UI Health Check

       ✓ status was 200
       ✓ transaction time 1 second
       ✓ body size OK
       ✓ body contains string

     █ DEV Pay By Text API Health Check

       ✓ status was 200
       ✗ transaction time 1 second
        ↳  99% — ✓ 48641 / ✗ 2
       ✓ body size OK
       ✓ body contains string

     █ IAT Pay By Text API Health Check

       ✓ status was 200
       ✓ transaction time 1 second
       ✓ body size OK
       ✓ body contains string

     █ QAR Pay By Text API Health Check

       ✓ status was 200
       ✓ transaction time 1 second
       ✓ body size OK
       ✓ body contains string

     █ XAT Pay By Text API Health Check

       ✓ status was 200
       ✓ transaction time 1 second
       ✓ body size OK
       ✓ body contains string

     █ DEV payer-account-api Health Check

       ✓ status was 200
       ✗ transaction time 1 second
        ↳  99% — ✓ 48641 / ✗ 2
       ✓ body size OK
       ✓ body contains string

     checks.........................: 99.99% ✓ 3307706    ✗ 18
     data_received..................: 426 MB 270 kB/s
     data_sent......................: 36 MB  23 kB/s
     group_duration.................: avg=1.01s    min=1s     med=1.01s  max=2.48s    p(90)=1.02s    p(95)=1.03s
     http_req_blocked...............: avg=133.02µs min=0s     med=0s     max=386.58ms p(90)=0s       p(95)=0s
     http_req_connecting............: avg=83.9µs   min=0s     med=0s     max=68.24ms  p(90)=0s       p(95)=0s
     http_req_duration..............: avg=11.88ms  min=0s     med=6.5ms  max=1.46s    p(90)=20.63ms  p(95)=32.5ms
       { expected_response:true }...: avg=11.59ms  min=0s     med=6.26ms max=1.22s    p(90)=20.12ms  p(95)=31.74ms
     http_req_failed................: 5.88%  ✓ 48643      ✗ 778288
     http_req_receiving.............: avg=151.27µs min=0s     med=0s     max=140.85ms p(90)=544.29µs p(95)=748.95µs
     http_req_sending...............: avg=38.69µs  min=0s     med=0s     max=61.34ms  p(90)=0s       p(95)=411.85µs
     http_req_tls_handshaking.......: avg=47.65µs  min=0s     med=0s     max=377.38ms p(90)=0s       p(95)=0s
     http_req_waiting...............: avg=11.69ms  min=0s     med=6.34ms max=1.46s    p(90)=20.36ms  p(95)=32.22ms
     http_reqs......................: 826931 524.378638/s
     iteration_duration.............: avg=17.26s   min=17.08s med=17.23s max=19.29s   p(90)=17.35s   p(95)=17.43s
     iterations.....................: 48643  30.845802/s
     vus............................: 1      min=1        max=1200
     vus_max........................: 1200   min=1200     max=1200
Kong and Payer NextGen APIs Results from Keith AVD
█ Kong API

   ✓ status was 401
   ✗ transaction time 1 second
    ↳  99% — ✓ 48696 / ✗ 8
   ✓ body size OK
   ✓ body contains string

 █ Kong UI

   ✓ status was 200
   ✗ transaction time 1 second
    ↳  99% — ✓ 48702 / ✗ 2
   ✓ body size OK
   ✓ body contains string

 █ SBX One Time Payment API Health Check

   ✓ status was 200
   ✓ transaction time 1 second
   ✓ body size OK
   ✓ body contains string

 █ DEV One Time Payment API Health Check

   ✓ status was 200
   ✗ transaction time 1 second
    ↳  99% — ✓ 48703 / ✗ 1
   ✓ body size OK
   ✓ body contains string

 █ IAT One Time Payment API Health Check

   ✓ status was 200
   ✓ transaction time 1 second
   ✓ body size OK
   ✓ body contains string

 █ QAR One Time Payment API Health Check

   ✓ status was 200
   ✗ transaction time 1 second
    ↳  99% — ✓ 48703 / ✗ 1
   ✓ body size OK
   ✓ body contains string

 █ XAT One Time Payment API Health Check

   ✓ status was 200
   ✓ transaction time 1 second
   ✓ body size OK
   ✓ body contains string

 █ DEV Payer Portal UI Health Check

   ✓ status was 200
   ✗ transaction time 1 second
    ↳  99% — ✓ 48701 / ✗ 3
   ✓ body size OK
   ✓ body contains string

 █ IAT Payer Portal UI Health Check

   ✓ status was 200
   ✓ transaction time 1 second
   ✓ body size OK
   ✓ body contains string

 █ QAR Payer Portal UI Health Check

   ✓ status was 200
   ✓ transaction time 1 second
   ✓ body size OK
   ✓ body contains string

 █ XAT Payer Portal UI Health Check

   ✓ status was 200
   ✓ transaction time 1 second
   ✓ body size OK
   ✓ body contains string

 █ DEV Pay By Text API Health Check

   ✓ status was 200
   ✗ transaction time 1 second
    ↳  99% — ✓ 48702 / ✗ 2
   ✓ body size OK
   ✓ body contains string

 █ IAT Pay By Text API Health Check

   ✓ status was 200
   ✓ transaction time 1 second
   ✓ body size OK
   ✓ body contains string

 █ QAR Pay By Text API Health Check

   ✓ status was 200
   ✓ transaction time 1 second
   ✓ body size OK
   ✓ body contains string

 █ XAT Pay By Text API Health Check

   ✓ status was 200
   ✓ transaction time 1 second
   ✓ body size OK
   ✓ body contains string

 █ DEV payer-account-api Health Check

   ✓ status was 200
   ✗ transaction time 1 second
    ↳  99% — ✓ 48703 / ✗ 1
   ✓ body size OK
   ✓ body contains string

 checks.........................: 99.99% ✓ 3311854    ✗ 18
 data_received..................: 427 MB 271 kB/s
 data_sent......................: 36 MB  23 kB/s
 group_duration.................: avg=1.01s    min=1s     med=1s     max=2.71s    p(90)=1.02s   p(95)=1.03s
 http_req_blocked...............: avg=119.44µs min=0s     med=0s     max=417.77ms p(90)=0s      p(95)=0s
 http_req_connecting............: avg=73.62µs  min=0s     med=0s     max=138.89ms p(90)=0s      p(95)=0s
 http_req_duration..............: avg=11.21ms  min=0s     med=6.05ms max=1.7s     p(90)=19.17ms p(95)=30.5ms
   { expected_response:true }...: avg=10.89ms  min=0s     med=5.82ms max=1.22s    p(90)=18.62ms p(95)=29.57ms
 http_req_failed................: 5.88%  ✓ 48704      ✗ 779264
 http_req_receiving.............: avg=203.64µs min=0s     med=0s     max=110.95ms p(90)=538.9µs p(95)=844.5µs
 http_req_sending...............: avg=30.48µs  min=0s     med=0s     max=73.85ms  p(90)=0s      p(95)=267.7µs
 http_req_tls_handshaking.......: avg=44.49µs  min=0s     med=0s     max=415.67ms p(90)=0s      p(95)=0s
 http_req_waiting...............: avg=10.97ms  min=0s     med=5.86ms max=1.7s     p(90)=18.89ms p(95)=30.2ms
 http_reqs......................: 827968 525.014183/s
 iteration_duration.............: avg=17.23s   min=17.08s med=17.21s max=19.24s   p(90)=17.32s  p(95)=17.4s
 iterations.....................: 48704  30.883187/s
 vus............................: 3      min=1        max=1200
 vus_max........................: 1200   min=1200     max=1200
Azure Load Test
Load Test 1
Load Test 2
Metrics from NewRelic
Kong NonProd Cluster Graphs
https://onenr.io/0bRKo6B5YRE
Kong NonProd Cluster Summary
https://onenr.io/0BQrebMG6jZ
Kong NonProd Traffic Graphs
https://onenr.io/02R5qzk2oRb
DevTest VMs Graphs
https://onenr.io/02R5qzk0VRb
Analysis
The Node CPU saturation reached a maximum of 58% during the first Load Test run and a 78% during the second Load Test run.
There was no Scale Out event.
For the next Load Test session we plan on reducing the HPA 
cpu
 
averageUtilization
 to 
60%
.
 URL:/spaces/platform/pages/3229974530/Kong+DV2+-+Round+2+Load+Testing